Расширение КонтурEDI/КонтурEDI/InformationRegisters/КонтурEDI_ДополнительныеРеквизиты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КонтурEDI_ДополнительныеРеквизиты</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтурEDI_ТочкиДоставки</v8:Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтурEDI_Сообщения</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтурEDI_ДополнительныеСправочники</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеСтрока</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтурEDI_ТочкиДоставки</v8:Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтурEDI_Сообщения</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтКлиента</v8:Type>
						<v8:Type>cfg:CatalogRef.СтавкиНДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураПолученный</v8:Type>
						<v8:Type>cfg:CatalogRef.ДополнительныеОтчетыИОбработки</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаРеализации</v8:Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСПоставщиками</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриобретениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтурEDI_ДополнительныеСправочники</v8:Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Расширение КонтурEDI/КонтурEDI/CommonForms/КонтурEDI_НастройкаПодключенияМодуля/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьРасположенияОбработки();	
	ИнформацияЗапускаОбработки();
	
	МодальностьЗапрещена = МодальностьЗапрещена();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьРеквизитПутьКМодулю();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРасположенияОбработки()

	СписокРасположенияМодуля = Элементы.РасположениеМодуля.СписокВыбора;
    ЕстьСправочникДопОбработок = ЕстьСправочникДопОбработокСервер();
	
	Если ЕстьСправочникДопОбработок Тогда
		СписокРасположенияМодуля.Добавить("Справочник", "В справочнике дополнительных обработок");
	КонецЕсли; 
	
	СписокРасположенияМодуля.Добавить("Расширение", "В составе конфигурации");	
	СписокРасположенияМодуля.Добавить("Файл", "На этом компьютере или сетевой папке");
	
КонецПроцедуры

&НаСервере
Процедура ИнформацияЗапускаОбработки()

	РасположениеМодуля 	= ПолучитьЗначениеДополнительногоРеквизита(Неопределено, "РасположениеМодуляEDI");	
	ПутьКМодулю 		= ПолучитьЗначениеДополнительногоРеквизита(Неопределено, "ПутьКМодулюEDI");	

	Если НЕ ЗначениеЗаполнено(РасположениеМодуля) Тогда
		
		РасположениеМодуля = "Справочник"; 
		
	КонецЕсли;   
	
КонецПроцедуры

&НаСервере       
Функция ПолучитьЗначениеДополнительногоРеквизита(ПараметрОбъект, ПараметрСвойство)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Объект", ПараметрОбъект);
	Запрос.УстановитьПараметр("Свойство", ПараметрСвойство);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурEDI_ДополнительныеРеквизиты.Значение КАК Значение
	               |ИЗ
	               |	РегистрСведений.КонтурEDI_ДополнительныеРеквизиты КАК КонтурEDI_ДополнительныеРеквизиты
	               |ГДЕ
	               |	КонтурEDI_ДополнительныеРеквизиты.Объект = &Объект
	               |	И КонтурEDI_ДополнительныеРеквизиты.Свойство = &Свойство";
	
	Результат = Запрос.Выполнить();	
	
	Если Результат.Пустой() Тогда
		
		ЗначениеДопРеквизита = Неопределено;
		
	Иначе
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗначениеДопРеквизита = Выборка.Значение;
		
	КонецЕсли;
	
	Возврат ЗначениеДопРеквизита;
	
КонецФункции
		
&НаСервере
Процедура СохранитьНастройкиНаСервере()

	МенеджерЗаписи = РегистрыСведений.КонтурEDI_ДополнительныеРеквизиты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Неопределено;
	МенеджерЗаписи.Свойство = "РасположениеМодуляEDI";
	МенеджерЗаписи.Значение = РасположениеМодуля;
	МенеджерЗаписи.Записать(); 
	
	МенеджерЗаписи = РегистрыСведений.КонтурEDI_ДополнительныеРеквизиты.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект = Неопределено;
	МенеджерЗаписи.Свойство = "ПутьКМодулюEDI";
	МенеджерЗаписи.Значение = ПутьКМодулю;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	СохранитьНастройкиНаСервере();
	ПоказатьОповещениеПользователя("Настройки успешно сохранены");
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьРеквизитПутьКМодулю()
	
	Если РасположениеМодуля = "Справочник" Тогда
		Элементы.ПутьКМодулю.Заголовок = "Ссылка";
		                 
		Если ЕстьСправочникДопОбработок Тогда
			Элементы.ПутьКМодулю.ОграничениеТипа = Новый ОписаниеТипов("СправочникСсылка.ДополнительныеОтчетыИОбработки");
		КонецЕсли;
		
	ИначеЕсли РасположениеМодуля = "Расширение" Тогда
		
		Элементы.ПутьКМодулю.ОграничениеТипа = Новый ОписаниеТипов("Строка");		
		Элементы.ПутьКМодулю.Заголовок = "Обработка";
		
	ИначеЕсли РасположениеМодуля = "Файл" Тогда
		
		Элементы.ПутьКМодулю.ОграничениеТипа = Новый ОписаниеТипов("Строка");		
		Элементы.ПутьКМодулю.Заголовок = "Путь к файлу";
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьКМодулюНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПутьКМодулюНачалоВыбораФрагмент();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПутьКМодулюНачалоВыбораФрагмент()

	Если РасположениеМодуля = "Файл" Тогда
		
		Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		Диалог.Заголовок = "Выберите файл";
		Диалог.ПолноеИмяФайла = ""; 
		Диалог.Фильтр = "epf (*.epf)|*.epf"; 
		Диалог.МножественныйВыбор = Ложь;	
		
		Если Диалог.Выбрать() Тогда
			
			ПутьКМодулю = Диалог.ПолноеИмяФайла;
			
		КонецЕсли;
		
	ИначеЕсли РасположениеМодуля = "Справочник"
		ИЛИ РасположениеМодуля = "Расширение" Тогда
		
		Если РасположениеМодуля = "Справочник" Тогда	
			СписокОбработок = СписокОбработокСправочника(); 	
		Иначе 
			СписокОбработок = СписокОбработокКонфигурации();	
		КонецЕсли;   
		
		Если МодальностьЗапрещена Тогда
			
			ПараметрыОповещения = Новый Массив;
			ПараметрыОповещения.Добавить("ПутьКМодулюНачалоВыбораЗавершение");
			ПараметрыОповещения.Добавить(ЭтаФорма);
			
			ОписаниеОповещения = Новый("ОписаниеОповещения", ПараметрыОповещения);
			
			СписокОбработок.ПоказатьВыборЭлемента(ОписаниеОповещения, "Выберите обработку Контур.EDI", Элементы.ПутьКМодулю); 
			
		Иначе      
			             
			ВыбранныйЭлемент = СписокОбработок.ВыбратьЭлемент("Выберите обработку Контур.EDI", Элементы.ПутьКМодулю);
			ПутьКМодулюНачалоВыбораЗавершение(ВыбранныйЭлемент);
			
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПутьКМодулюНачалоВыбораЗавершение(Результат, ДопПараметры = Неопределено) Экспорт

	Если Результат <> Неопределено Тогда
		ПутьКМодулю = Результат.Значение;	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция СписокОбработокСправочника()
	
	СписокОбработок = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ДополнительныеОтчетыИОбработки.Ссылка КАК Ссылка,
	               |	ДополнительныеОтчетыИОбработки.Наименование КАК Наименование,
	               |	ДополнительныеОтчетыИОбработки.Версия КАК Версия,
	               |	ДополнительныеОтчетыИОбработки.Публикация КАК Публикация
	               |ИЗ
	               |	Справочник.ДополнительныеОтчетыИОбработки КАК ДополнительныеОтчетыИОбработки
	               |ГДЕ
	               |	НЕ ДополнительныеОтчетыИОбработки.ПометкаУдаления
	               |	И ДополнительныеОтчетыИОбработки.Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка)";

	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
			
		ТаблицаОбработок = Результат.Выгрузить();
		
		Для Каждого ТекОбработка Из ТаблицаОбработок Цикл
			
			СписокОбработок.Добавить(ТекОбработка.Ссылка, ТекОбработка.Наименование + " v." + ТекОбработка.Версия + " ("+ТекОбработка.Публикация + ")", , БиблиотекаКартинок.СправочникОбъект);
			
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат СписокОбработок;
	
КонецФункции

&НаСервере
Функция СписокОбработокКонфигурации()

	СписокОбработокКонфигурации = Новый СписокЗначений;
	Для Каждого Обработка Из Метаданные.Обработки Цикл		
		СписокОбработокКонфигурации.Добавить(Обработка.Имя,,,БиблиотекаКартинок.Обработка);
	КонецЦикла;

	Возврат СписокОбработокКонфигурации;

КонецФункции

&НаСервере
Функция ЕстьСправочникДопОбработокСервер()

	Возврат (НЕ Метаданные.Справочники.Найти("ДополнительныеОтчетыИОбработки") = Неопределено);

КонецФункции

&НаКлиенте
Процедура РасположениеМодуляПриИзменении(Элемент)
	
	Элементы.ПутьКМодулю.ОграничениеТипа = Новый ОписаниеТипов("");
	ПутьКМодулю = Неопределено;
	
	ОбновитьРеквизитПутьКМодулю();
	ПутьКМодулюНачалоВыбораФрагмент();
	
КонецПроцедуры   

&НаСервере
Функция МодальностьЗапрещена()
	
	МодальностьЗапрещена = Ложь;
	
	Попытка
		Если НЕ Метаданные.РежимИспользованияМодальности = Метаданные.СвойстваОбъектов.РежимИспользованияМодальности.Использовать Тогда 
			МодальностьЗапрещена = Истина;
		КонецЕсли;
	Исключение
		_ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
	
	Возврат МодальностьЗапрещена;
	
КонецФункции
